=================================================
Infered Type
=================================================

fn main() {
  return 1
}

-------------------------------------------------

(source_file
  (function_definition_list
    (function_definition
      (identifier)
      (parameter_list)
      (block
        (statement_list
          (return_statement
            (integer)))))))

=================================================
Explicit Type
=================================================

fn main() -> int {
    return 1
}

-------------------------------------------------

(source_file
    (function_definition_list
    (function_definition
        (identifier)
        (parameter_list)
        (single_value_type
          (identifier))
        (block
        (statement_list
            (return_statement
            (integer)))))))

=================================================
Parameters
=================================================

fn main(a: int, b: float, c: bool) {
  return 1
}

-------------------------------------------------

(source_file
  (function_definition_list
    (function_definition
      (identifier)
      (parameter_list
        (parameter
          (identifier)
          (single_value_type
            (identifier)))
        (parameter
          (identifier)
          (single_value_type
            (identifier)))
        (parameter
          (identifier)
          (single_value_type
            (identifier))))
      (block
        (statement_list
          (return_statement
            (integer)))))))

=================================================
Parameters w/ Explicit Type
=================================================

fn main(a: int, b: float, c: bool) -> int {
  return 1
}

-------------------------------------------------

(source_file
  (function_definition_list
    (function_definition
      (identifier)
      (parameter_list
        (parameter
          (identifier)
          (single_value_type
            (identifier)))
        (parameter
          (identifier)
          (single_value_type
            (identifier)))
        (parameter
          (identifier)
          (single_value_type
            (identifier))))
      (single_value_type
        (identifier))
      (block
        (statement_list
          (return_statement
            (integer)))))))